renfernand/OWSNRIT/openwsn/bsp/boards/cc2538em/inc/hw_rfcore_sfr.h
#define RFCORE_SFR_MTIRQF_MACTIMER_OVF_PERF_M \
                                0x00000008
#define RFCORE_SFR_MTIRQF_MACTIMER_OVF_PERF_S 3
#define RFCORE_SFR_MTIRQF_MACTIMER_COMPARE2F \
                                0x00000004  // Set when the MAC Timer counter 
                                            // counts to the value set at 
                                            // MT_cmp2 

#define RFCORE_SFR_MTIRQF_MACTIMER_COMPARE2F_M \
                                0x00000004
#define RFCORE_SFR_MTIRQF_MACTIMER_COMPARE2F_S 2
#define RFCORE_SFR_MTIRQF_MACTIMER_COMPARE1F \
                                0x00000002  // Set when the MAC Timer counter 
                                            // counts to the value set at 
                                            // MT_cmp1 

#define RFCORE_SFR_MTIRQF_MACTIMER_COMPARE1F_M \
                                0x00000002
#define RFCORE_SFR_MTIRQF_MACTIMER_COMPARE1F_S 1
#define RFCORE_SFR_MTIRQF_MACTIMER_PERF \
                                0x00000001  // Set when the MAC Timer counter 
                                            // would have counted to a value 
                                            // equal to MT_per, but instead 
                                            // wraps to 0 

#define RFCORE_SFR_MTIRQF_MACTIMER_PERF_M \
                                0x00000001
#define RFCORE_SFR_MTIRQF_MACTIMER_PERF_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_SFR_MTMSEL register.
//
//*****************************************************************************
#define RFCORE_SFR_MTMSEL_MTMOVFSEL_M \
                                0x00000070  // The value of this register 
                                            // selects the internal registers 
                                            // that are modified or read when 
                                            // accessing MTMOVF0, MTMOVF1, and 
                                            // MTMOVF2. 000: MTovf (overflow 
                                            // counter) 001: MTovf_cap 
                                            // (overflow capture) 010: 
                                            // MTovf_per (overflow period) 011: 
                                            // MTovf_cmp1 (overflow compare 1) 
                                            // 100: MTovf_cmp2 (overflow 
                                            // compare 2) 101 to 111: Reserved 

#define RFCORE_SFR_MTMSEL_MTMOVFSEL_S 4
#define RFCORE_SFR_MTMSEL_MTMSEL_M \
                                0x00000007  // The value of this register 
                                            // selects the internal registers 
                                            // that are modified or read when 
                                            // accessing MTM0 and MTM1. 000: 
                                            // MTtim (timer count value) 001: 
                                            // MT_cap (timer capture) 010: 
                                            // MT_per (timer period) 011: 
                                            // MT_cmp1 (timer compare 1) 100: 
                                            // MT_cmp2 (timer compare 2) 101 to 
                                            // 111: Reserved MTM0 

#define RFCORE_SFR_MTMSEL_MTMSEL_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_SFR_MTM0 register.
//
//*****************************************************************************
#define RFCORE_SFR_MTM0_MTM0_M  0x000000FF  // Indirectly returns and modifies 
                                            // bits [7:0] of an internal 
                                            // register depending on the value 
                                            // of MTMSEL.MTMSEL. When reading 
                                            // the MTM0 register with 
                                            // MTMSEL.MTMSEL set to 000 and 
                                            // MTCTRL.LATCH_MODE set to 0, the 
                                            // timer (MTtim) value is latched. 
                                            // When reading the MTM0 register 
                                            // with MTMSEL.MTMSEL set to 000 
                                            // and MTCTRL.LATCH_MODE set to 1, 
                                            // the timer (MTtim) and overflow 
                                            // counter (MTovf) values are 
                                            // latched. 
#define RFCORE_SFR_MTM0_MTM0_S  0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_SFR_MTM1 register.
//
//*****************************************************************************
#define RFCORE_SFR_MTM1_MTM1_M  0x000000FF  // Indirectly returns and modifies 
                                            // bits [15:8] of an internal 
                                            // register, depending on the value 
                                            // of MTMSEL.MTMSEL. When reading 
                                            // the MTM0 register with 
                                            // MTMSEL.MTMSEL set to 000, the 
                                            // timer (MTtim) value is latched. 
                                            // Reading this register with 
                                            // MTMSEL.MTMSEL set to 000 returns 
                                            // the latched value of 
                                            // MTtim[15:8]. 
#define RFCORE_SFR_MTM1_MTM1_S  0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_SFR_MTMOVF2 register.
//
//*****************************************************************************
#define RFCORE_SFR_MTMOVF2_MTMOVF2_M \
                                0x000000FF  // Indirectly returns and modifies 
                                            // bits [23:16] of an internal 
                                            // register, depending on the value 
                                            // of MTMSEL.MTMOVFSEL. Reading 
                                            // this register with 
                                            // MTMSEL.MTMOVFSEL set to 000 
                                            // returns the latched value of 
                                            // MTovf[23:16]. 

#define RFCORE_SFR_MTMOVF2_MTMOVF2_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_SFR_MTMOVF1 register.
//
//*****************************************************************************
#define RFCORE_SFR_MTMOVF1_MTMOVF1_M \
                                0x000000FF  // Indirectly returns and modifies 
                                            // bits [15:8] of an internal 
                                            // register, depending on the value 
                                            // of MTMSEL.MTMSEL. Reading this 
                                            // register with MTMSEL.MTMOVFSEL 
                                            // set to 000 returns the latched 
                                            // value of MTovf[15:8]. 

#define RFCORE_SFR_MTMOVF1_MTMOVF1_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_SFR_MTMOVF0 register.
//
//*****************************************************************************
#define RFCORE_SFR_MTMOVF0_MTMOVF0_M \
                                0x000000FF  // Indirectly returns and modifies 
                                            // bits [7:0] of an internal 
                                            // register, depending on the value 
                                            // of MTMSEL.MTMOVFSEL. When 
                                            // reading the MTMOVF0 register 
                                            // with MTMSEL.MTMOVFSEL set to 000 
                                            // and MTCTRL.LATCH_MODE set to 0, 
                                            // the overflow counter value 
                                            // (MTovf) is latched. When reading 
                                            // the MTM0 register with 
                                            // MTMSEL.MTMOVFSEL set to 000 and 
                                            // MTCTRL.LATCH_MODE set to 1, the 
                                            // overflow counter value (MTovf) 
                                            // is latched. 

#define RFCORE_SFR_MTMOVF0_MTMOVF0_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_SFR_RFDATA register.
//
//*****************************************************************************
#define RFCORE_SFR_RFDATA_RFD_M 0x000000FF  // Data written to the register is 
                                            // written to the TX FIFO. When 
                                            // reading this register, data from 
                                            // the RX FIFO is read. 
#define RFCORE_SFR_RFDATA_RFD_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// RFCORE_SFR_RFERRF register.
//
//*****************************************************************************
#define RFCORE_SFR_RFERRF_STROBEERR \
                                0x00000040  // A command strobe was issued 
                                            // when it could not be processed. 
                                            // Triggered if trying to disable 
                                            // the radio when it is already 
                                            // disabled, or when trying to do a 
                                            // SACK, SACKPEND, or SNACK command 
                                            // when not in active RX. 0: No 
                                            // interrupt pending 1: Interrupt 
                                            // pending 

